# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright 1997-2010 Oracle and/or its affiliates. All rights reserved.
#
# Oracle and Java are registered trademarks of Oracle and/or its affiliates.
# Other names may be trademarks of their respective owners.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common
# Development and Distribution License("CDDL") (collectively, the
# "License"). You may not use this file except in compliance with the
# License. You can obtain a copy of the License at
# http://www.netbeans.org/cddl-gplv2.html
# or nbbuild/licenses/CDDL-GPL-2-CP. See the License for the
# specific language governing permissions and limitations under the
# License.  When distributing the software, include this License Header
# Notice in each file and include the License file at
# nbbuild/licenses/CDDL-GPL-2-CP.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the GPL Version 2 section of the License file that
# accompanied this code. If applicable, add the following below the
# License Header, with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Contributor(s):
#
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2006 Sun
# Microsystems, Inc. All Rights Reserved.
#
# If you wish your version of this file to be governed by only the CDDL
# or only the GPL Version 2, indicate your decision by adding
# "[Contributor] elects to include this software in this distribution
# under the [CDDL or GPL Version 2] license." If you do not indicate a
# single choice of license, a recipient has the option to distribute
# your version of this file under either the CDDL, the GPL Version 2 or
# to extend the choice of license to its licensees as provided above.
# However, if you add GPL Version 2 code and therefore, elected the GPL
# Version 2 license, then the option applies only if the new code is
# made subject to such option by the copyright holder. 

Editors/text/x-fx/Popup/Profiling/org-netbeans-modules-visage-profiler-actions-AddProfilingRootMethodAction.shadow=Adicionar como m\u00e9todo raiz de cria\u00e7\u00e3o de perfil...
Editors/text/x-fx/Popup/Profiling/org-netbeans-modules-visage-profiler-actions-SelectVisageRootMethodsAction.shadow=Selecionar m\u00e9todos raiz de cria\u00e7\u00e3o de perfil...
Editors/text/x-fx/Popup/Profiling/org-netbeans-modules-visage-profiler-actions-SelectRootMethodsAction.shadow=Selecionar m\u00e9todos raiz de cria\u00e7\u00e3o de perfil...
OpenIDE-Module-Short-Description=Perfil Visage

## Resource bundle for package org.netbeans.modules.profiler.

OpenIDE-Module-Display-Category=Visage
OpenIDE-Module-Name=Perfil Visage
OpenIDE-Module-Long-Description=Suplemento para NetBeans Profiler que fornece suporte a profiling em projetos Visage

Editors/text/x-fx/Popup/Profiling=Cria\u00e7\u00e3o de peril

VisageProjectTypeProfiler_ModifyBuildScriptCaption=Habilitar a cria\u00e7\u00e3o de perfil de {0}
VisageProjectTypeProfiler_ModifyBuildScriptMsg=<html><b>O profiler n\u00e3o est\u00e1 integrado ao projeto {0}.<br>Clique em OK para realizar a integra\u00e7\u00e3o.</b><br><br>Como parte da integra\u00e7\u00e3o, o script de constru\u00e7\u00e3o do projeto ser\u00e1 modificado.<br>Ser\u00e1 criado um backup do arquivo original como {1}.<br><br>Observa\u00e7\u00e3o: voc\u00ea pode desfazer a integra\u00e7\u00e3o do profiler a qualquer momento invocando <br>Perfil | Comandos avan\u00e7ados | Desintegrar Profiler no menu principal.</html>
VisageProjectTypeProfiler_RegenerateBuildScriptMsg=O script de constru\u00e7\u00e3o {0} foi modificado.\nEle precisa ser regenerado para continuar com a cria\u00e7\u00e3o de perfil.\n\nDeseja continuar?
VisageProjectTypeProfiler_CannotFindBuildScriptMsg=N\u00e3o \u00e9 poss\u00edvel localizar o arquivo {0} do projeto.
VisageProjectTypeProfiler_CannotBackupBuildScriptMsg=N\u00e3o \u00e9 poss\u00edvel realizar o backup do script de constru\u00e7\u00e3o do projeto.  Ainda deseja continuar?
VisageProjectTypeProfiler_ModifyBuildScriptManuallyMsg=O arquivo do projeto {0} n\u00e3o pode ser automaticamente modificado para a cria\u00e7\u00e3o de perfil.  Voc\u00ea precisa inserir manualmente a seguinte cl\u00e1usula de importa\u00e7\u00e3o\:\n{1}\nRealize essa altera\u00e7\u00e3o e inicie a cria\u00e7\u00e3o de perfil novamente.
VisageProjectTypeProfiler_ProjectCategory=Projeto
VisageProjectTypeProfiler_ListenersCategory=Listeners AWT e Swing
VisageProjectTypeProfiler_PaintersCategory=Painters AWT e Swing
VisageProjectTypeProfiler_IoCategory=E/S de Java
VisageProjectTypeProfiler_FilesCategory=Arquivos
VisageProjectTypeProfiler_SocketsCategory=Soquetes

JavaApplicationIntegrationProvider_Title=Aplicativo Java
# HTML-formatted
JavaApplicationIntegrationProvider_ManualRemoteStep3Message=Execute o aplicativo usando {0}.  Ao iniciar o servidor, forne\u00e7a uma op\u00e7\u00e3o extra de inicializa\u00e7\u00e3o para o comando <code>java</code>\:<br><code>{1}</code><br> {2}.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualRemoteStep4Message=A JVM ser\u00e1 iniciada, mas n\u00e3o continuar\u00e1 a execu\u00e7\u00e3o do servidor at\u00e9 voc\u00ea se conectar ao profiler.</p>
# HTML-formatted
JavaApplicationIntegrationProvider_ManualRemoteHintMessage=Voc\u00ea pode usar o comando <code>{0}</code> em vez do comando <code>java</code> para executar o aplicativo no modo de cria\u00e7\u00e3o de perfil. Verifique o script para verificar modifica\u00e7\u00f5es adicionais de acordo com a configura\u00e7\u00e3o do sistema.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDirectStep1Message=Execute o aplicativo usando {0}.  Ao iniciar o aplicativo, forne\u00e7a a op\u00e7\u00e3o extra de inicializa\u00e7\u00e3o para o comando <code>java</code>\:<br><code>{1}</code>
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDirectStep2Message=A JVM ser\u00e1 iniciada, mas n\u00e3o continuar\u00e1 a execu\u00e7\u00e3o do servidor at\u00e9 voc\u00ea se conectar ao profiler.
# HTML-formatted
JavaApplicationIntegrationProvider_DynamicWarningMessage=Certifique-se de que o IDE esteja usando {0}.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDynamicStep1Message=Inicie o aplicativo usando {0}.
# HTML-formatted
JavaApplicationIntegrationProvider_ManualDynamicStep2Message=Quando o aplicativo estiver sendo executado, clique em Conectar para selecionar o processo do aplicativo ao qual se deve conectar.

JavaAppletIntegrationProvider_Title=Applet Java
JavaAppletIntegrationProvider_AppletWorkDirWindowsMessage=O diret\u00f3rio de trabalho do applet depende do tipo de navegador Web.  Para o Internet Explorer, use <%USERPROFILE%>\\Desktop; para Mozilla e Firefox, use o diret\u00f3rio de instala\u00e7\u00e3o do navegador; para Opera, use o caminho onde est\u00e1 a p\u00e1gina html que abre o applet.
JavaAppletIntegrationProvider_AppletWorkDirUnixesMessage=O diret\u00f3rio de trabalho do applet \u00e9, em geral, o local onde o navegador Web que executa o applet foi iniciado.
# HTML-formatted
JavaAppletIntegrationProvider_OperaRemoteAttachWarningMessage=Como o navegador Opera usa JRE em pacote ou padr\u00e3o para executar os applets, em vez do plug-in Java e nenhum argumento pode ser passado a ele, ele n\u00e3o pode ser usado para criar perfil de applets remotamente.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep3Message=Feche todas as janelas e guias do navegador Web remoto.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep4WindowsMessage=Abra o painel de controle Java no painel de controle do Windows. Abra a guia Java e clique em Exibir na \u00e1rea Configura\u00e7\u00f5es de tempo de execu\u00e7\u00e3o de applets Java. Abra a caixa de di\u00e1logo Configura\u00e7\u00f5es de tempo de execu\u00e7\u00e3o Java. Clique duas vezes na c\u00e9lula Par\u00e2metros de tempo de execu\u00e7\u00e3o Java e insira a seguinte string\:<br><code>{0}</code><br>Feche a caixa de di\u00e1logo usando o bot\u00e3o OK e clique em OK ou em Aplicar no painel de controle Java.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep4UnixesMessage=Abra o painel de controle Java do JRE que executar\u00e1 o applet com perfil usando o comando <code>&lt;$JAVA_HOME&gt;/jre/bin/ControlPanel</code>.  Abra a guia Java e clique em Exibir na \u00e1rea Configura\u00e7\u00f5es de tempo de execu\u00e7\u00e3o de applets Java.  Abra a caixa de di\u00e1logo Configura\u00e7\u00f5es de tempo de execu\u00e7\u00e3o Java. Clique duas vezes na c\u00e9lula Par\u00e2metros de tempo de execu\u00e7\u00e3o Java e insira a seguinte string\:<br><code>{0}</code><br>Feche a caixa de di\u00e1logo usando o bot\u00e3o OK e clique em OK ou em Aplicar no painel de controle Java.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStep5Message=Inicie o applet no navegador Web remoto.  A janela do navegador \u00e9 aberta, mas o applet iniciar\u00e1 somente quando voc\u00ea se conectar ao profiler.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteStopAppletMessage=A JVM do applet continuar\u00e1 sendo executada, at\u00e9 voc\u00ea interromp\u00ea-la usando a a\u00e7\u00e3o Remover Profiler ou at\u00e9 que todas as janelas e guias do navegador remoto sejam fechadas.
# HTML-formatted
JavaAppletIntegrationProvider_ManualRemoteRestoreSettingsMessage=Voc\u00ea precisar\u00e1 restaurar o valor original da c\u00e9lula Par\u00e2metros de tempo de execu\u00e7\u00e3o Java para conseguir executar applets sem a cria\u00e7\u00e3o de perfil no sistema remoto.
# HTML-formatted
JavaAppletIntegrationProvider_OperaDirectAttachWarningMessage=Como o navegador Opera usa JRE em pacotes ou padr\u00e3o para executar os applets, em vez do plug-in Java e nenhum argumento pode ser passado a ele, ele n\u00e3o pode ser usado para criar perfil de applets usando conex\u00e3o direta.
# HTML-formatted
JavaAppletIntegrationProvider_ManualLocalStep1Message=Feche todas as janelas e guias do navegador Web.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep2WindowsMessage=Abra o painel de controle Java no painel de controle do Windows. Abra a guia Java e clique em Exibir na \u00e1rea Configura\u00e7\u00f5es de tempo de execu\u00e7\u00e3o de applets Java.  Abra a caixa de di\u00e1logo Configura\u00e7\u00f5es de tempo de execu\u00e7\u00e3o Java. Clique duas vezes na c\u00e9lula Par\u00e2metros de tempo de execu\u00e7\u00e3o Java e insira a seguinte string\:<br><code>{0}</code><br>Feche a caixa de di\u00e1logo usando o bot\u00e3o OK e clique em OK ou em Aplicar no painel de controle Java.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep2UnixesMessage=Abra o painel de controle Java do JRE que executar\u00e1 o applet com perfil usando o comando <code>&lt;$JAVA_HOME&gt;/jre/bin/ControlPanel</code>.   Abra a guia Java e clique em Exibir na \u00e1rea Configura\u00e7\u00f5es de tempo de execu\u00e7\u00e3o de applets Java.  Abra a caixa de di\u00e1logo Configura\u00e7\u00f5es de tempo de execu\u00e7\u00e3o Java. Clique duas vezes na c\u00e9lula Par\u00e2metros de tempo de execu\u00e7\u00e3o Java e insira a seguinte string\:<br><code>{0}</code><br>Feche a caixa de di\u00e1logo usando o bot\u00e3o OK e clique em OK ou em Aplicar no painel de controle Java.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStep3Message=Inicie o applet no navegador Web.   A janela do navegador \u00e9 aberta, mas o applet iniciar\u00e1 somente quando voc\u00ea se conectar ao profiler.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectStopAppletMessage=A JVM do applet continuar\u00e1 sendo executada, at\u00e9 voc\u00ea interromp\u00ea-la usando a a\u00e7\u00e3o Remover Profiler ou at\u00e9 que todas as janelas e guias do navegador remoto sejam fechadas.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDirectRestoreSettingsMessage=Voc\u00ea precisar\u00e1 restaurar o valor original da c\u00e9lula Par\u00e2metros de tempo de execu\u00e7\u00e3o Java para conseguir executar applets sem a cria\u00e7\u00e3o de perfil.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDynamicStep2WindowsMessage=Abra o painel de controle Java do painel de controle do Windows e certifique-se de que {0} ser\u00e1 usado para executar o applet com perfil.<br><br>Observa\u00e7\u00e3o\: o navegador Opera n\u00e3o usa plug-in Java para executar os applets.  Consulte a documenta\u00e7\u00e3o on-line do Opera para obter instru\u00e7\u00f5es sobre como alterar o JRE usado para executar os applets.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDynamicStep2UnixesMessage=Certifique-se de que seu navegador configurou {0} para executar o applet com perfil.
# HTML-formatted
JavaAppletIntegrationProvider_ManualDynamicStep3Message=Inicie o applet no navegador Web.   Quando o applet estiver sendo executado, clique em Conectar para selecionar o processo do applet ao qual deve se conectar.

# new keys

